docs/spec.org
#+Title: Pixie Specification - Version 1.0
#+Author: Raghu Kaippully

#+OPTIONS: html-postamble:nil toc:2
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-style.css"/>

* Introduction

Pixie is an abstract computer. This document describes the features
and architecture of Pixie.

* Instruction Set Architecture

The following sections define the instruction set architecture of
Pixie.

** Notation

The notation defined in this section will be used throughout this
document.

#+CAPTION: Notation
| Notation        | Description                                                                                          |
|-----------------+------------------------------------------------------------------------------------------------------|
| =X[l:r]=        | The field delimited by bit =l= on the left and =r= on the right (both inclusive) of the element =X=. |
| =X[b]=          | Same as =X[b:b]=.                                                                                    |
| =MemB[addr]=    | Refers to the 8-bit memory location at address =addr=.                                               |
| =MemS[addr]=    | Refers to the 16-bit memory location at address =addr=.                                              |
| =MemW[addr]=    | Refers to the 32-bit memory location at address =addr=.                                              |
| =Port[p]=       | Refers to the contents of I/O port numbered =p=.                                                     |
| =LShift(X, n)=  | Shift =X= to the left by =n= bits and zero-fill the vacated bit positions.                           |
| =RShift(X, n)=  | Shift =X= to the right by =n= bits and zero-fill the vacated bit positions.                          |
| =RAShift(X, n)= | Shift =X= to the right by =n= bits. Sign-extend the vacated bit positions.                           |
| =ZExtend(X, n)= | Zeroes are appended to the left of =X= to make it =n= bits wide.                                     |
| =SExtend(X, n)= | Replicate the most significant bit of X as many times as necessary to make it =n= bits wide.         |
| =SCT[n]=        | The n^th entry in the system call table.                                                             |
| =Set_Flags(X)=  | Update =ZF=, =PF=, and =NF= according to the value =X=.                                              |
| =Next_Reg(n)=   | The general purpose register numbered =(n + 1) modulo 8=.                                            |

** Memory Address Space

Pixie can address 2^20 memory locations each containing a
byte. Addresses are numbered from =0x00000= to =0xfffff=. Some regions
of memory are reserved for special uses as mentioned in [[*Memory Layout][Memory Layout]].

** Data Types

The basic data types of Pixie are bytes (8 bits), shorts (16 bits),
words (32 bits), and doublewords (64 bits). A byte can be located at
any memory location. Shorts, words, and doublewords must be aligned in
memory at natural boundaries. That is, a short must be located at an
even-numbered address, a word must be located at an address divisible
by four, and a doubleword must be located at an address divisible by
eight. Unaligned memory accesses will result in an error that will be
handled in an implementation-defined manner.

Some instructions interpret these basic data types as signed and
unsigned integers or addresses.

** Endianness and Addressing

Bits of a memory location are arranged from right to left such that
the least significant bit is in the rightmost position and most
significant bit is in the leftmost position.

Shorts and words are stored in memory such that the least significant
byte is stored at the smallest memory address. The address of a short
or word is the address of its least significant byte.

** Modes of Operation

At any point of time, Pixie operates in one of the two modes - user
mode or supervisor mode. The user mode is used to run normal programs
while the supervisor mode is used by the operating system and
interrupt handlers. Certain privileged instructions are only allowed
in the supervisor mode.

The current mode is indicated by the [[*Machine Status Register][Mode Indicator Bit]] in the machine
status register. This bit can only be changed using a [[*Mode Switching][mode switching
operation]].

** Mode Switching

The processor switches from user mode to supervisor mode on any of the
following conditions:

- When an interrupt is serviced as described in [[*Interrupt Handling][Interrupt Handling]] section.
- When the processor executes the [[*SCL][SCL]] instruction.

The processor switches from supervisor mode to user mode on any of the
following conditions:

- When the processor executes the [[*RET][RETI]] instruction and the [[*Machine Status Register][Mode
  Indicator]] bit in the machine status register image in the stack is
  clear.
- When the processor executes the [[*RET][RETS]] instruction.

** Registers

*** General Purpose Registers

There are sixteen 32-bit general purpose registers numbered from 0
to 15. The assembly instructions refer to these registers as =R0= to
=R15= respectively.

