docs/spec.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-17 Wed 19:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pixie Specification - Version 1.0</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Raghu Kaippully">
<link rel="stylesheet" type="text/css" href="org-style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Pixie Specification - Version 1.0</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdec80b9">1. Introduction</a></li>
<li><a href="#orge67698e">2. Instruction Set Architecture</a>
<ul>
<li><a href="#org19ef9a4">2.1. Notation</a></li>
<li><a href="#org04bc95f">2.2. Memory Address Space</a></li>
<li><a href="#orgfb943fb">2.3. Data Types</a></li>
<li><a href="#org67f855a">2.4. Endianness and Addressing</a></li>
<li><a href="#orge6c22ce">2.5. Modes of Operation</a></li>
<li><a href="#org6aa924a">2.6. Mode Switching</a></li>
<li><a href="#orga78e83c">2.7. Registers</a></li>
<li><a href="#orga244ae7">2.8. Memory Layout</a></li>
<li><a href="#orgfc38cc6">2.9. CPU Operation</a></li>
<li><a href="#org24deb5d">2.10. Input and Output</a></li>
<li><a href="#org48f6ad1">2.11. System Calls</a></li>
<li><a href="#org82e9792">2.12. Initialization</a></li>
<li><a href="#org97236de">2.13. Instruction Format</a></li>
</ul>
</li>
<li><a href="#org3c7c6aa">3. Instructions</a>
<ul>
<li><a href="#org5d8d54b">3.1. ADD</a></li>
<li><a href="#orgbe45737">3.2. SUB</a></li>
<li><a href="#org08c1226">3.3. MUL</a></li>
<li><a href="#org1a52fdc">3.4. NEG</a></li>
<li><a href="#orga6dc16f">3.5. CMP</a></li>
<li><a href="#orgd1f456e">3.6. AND</a></li>
<li><a href="#org72c3231">3.7. OR</a></li>
<li><a href="#org4661fac">3.8. NOT</a></li>
<li><a href="#org716eedc">3.9. XOR</a></li>
<li><a href="#org6d7d6d9">3.10. SHF</a></li>
<li><a href="#org080f87e">3.11. JC</a></li>
<li><a href="#org2e07f6f">3.12. JMP</a></li>
<li><a href="#org53c2179">3.13. CALL</a></li>
<li><a href="#org961ea00">3.14. SCL</a></li>
<li><a href="#org6e98e8f">3.15. RET</a></li>
<li><a href="#orga8e91ea">3.16. LD</a></li>
<li><a href="#orga98a2c7">3.17. ST</a></li>
<li><a href="#org9356010">3.18. CPY</a></li>
<li><a href="#orgef010e0">3.19. PUSH</a></li>
<li><a href="#org01c0feb">3.20. POP</a></li>
<li><a href="#orgaccaf4a">3.21. IN</a></li>
<li><a href="#orgba169d5">3.22. OUT</a></li>
<li><a href="#org538f9c3">3.23. SSSP</a></li>
<li><a href="#orgdff880f">3.24. HALT</a></li>
</ul>
</li>
<li><a href="#org32901b9">4. Standard I/O Devices</a>
<ul>
<li><a href="#org7f0538d">4.1. Clock</a></li>
<li><a href="#orge871ea4">4.2. Character Input</a></li>
<li><a href="#org95377ef">4.3. Character Output</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdec80b9" class="outline-2">
<h2 id="orgdec80b9"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Pixie is an abstract computer. This document describes the features
and architecture of Pixie.
</p>
</div>
</div>

<div id="outline-container-orge67698e" class="outline-2">
<h2 id="orge67698e"><span class="section-number-2">2</span> Instruction Set Architecture</h2>
<div class="outline-text-2" id="text-2">
<p>
The following sections define the instruction set architecture of
Pixie.
</p>
</div>

<div id="outline-container-org19ef9a4" class="outline-3">
<h3 id="org19ef9a4"><span class="section-number-3">2.1</span> Notation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The notation defined in this section will be used throughout this
document.
</p>

<table>
<caption class="t-above"><span class="table-number">Table 1:</span> Notation</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Notation</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>X[l:r]</code></td>
<td class="org-left">The field delimited by bit <code>l</code> on the left and <code>r</code> on the right (both inclusive) of the element <code>X</code>.</td>
</tr>

<tr>
<td class="org-left"><code>X[b]</code></td>
<td class="org-left">Same as <code>X[b:b]</code>.</td>
</tr>

<tr>
<td class="org-left"><code>MemB[addr]</code></td>
<td class="org-left">Refers to the 8-bit memory location at address <code>addr</code>.</td>
</tr>

<tr>
<td class="org-left"><code>MemS[addr]</code></td>
<td class="org-left">Refers to the 16-bit memory location at address <code>addr</code>.</td>
</tr>

<tr>
<td class="org-left"><code>MemW[addr]</code></td>
<td class="org-left">Refers to the 32-bit memory location at address <code>addr</code>.</td>
</tr>

<tr>
<td class="org-left"><code>Port[p]</code></td>
<td class="org-left">Refers to the contents of I/O port numbered <code>p</code>.</td>
</tr>

<tr>
<td class="org-left"><code>LShift(X, n)</code></td>
<td class="org-left">Shift <code>X</code> to the left by <code>n</code> bits and zero-fill the vacated bit positions.</td>
</tr>

<tr>
<td class="org-left"><code>RShift(X, n)</code></td>
<td class="org-left">Shift <code>X</code> to the right by <code>n</code> bits and zero-fill the vacated bit positions.</td>
</tr>

<tr>
<td class="org-left"><code>RAShift(X, n)</code></td>
<td class="org-left">Shift <code>X</code> to the right by <code>n</code> bits. Sign-extend the vacated bit positions.</td>
</tr>

<tr>
<td class="org-left"><code>ZExtend(X, n)</code></td>
<td class="org-left">Zeroes are appended to the left of <code>X</code> to make it <code>n</code> bits wide.</td>
</tr>

<tr>
<td class="org-left"><code>SExtend(X, n)</code></td>
<td class="org-left">Replicate the most significant bit of X as many times as necessary to make it <code>n</code> bits wide.</td>
</tr>

<tr>
<td class="org-left"><code>SCT[n]</code></td>
<td class="org-left">The n<sup>th</sup> entry in the system call table.</td>
</tr>

<tr>
<td class="org-left"><code>Set_Flags(X)</code></td>
<td class="org-left">Update <code>ZF</code>, <code>PF</code>, and <code>NF</code> according to the value <code>X</code>.</td>
</tr>

<tr>
<td class="org-left"><code>Next_Reg(n)</code></td>
<td class="org-left">The general purpose register numbered <code>(n + 1) modulo 8</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org04bc95f" class="outline-3">
<h3 id="org04bc95f"><span class="section-number-3">2.2</span> Memory Address Space</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pixie can address 2<sup>20</sup> memory locations each containing a
byte. Addresses are numbered from <code>0x00000</code> to <code>0xfffff</code>. Some regions
of memory are reserved for special uses as mentioned in <a href="#orga244ae7">Memory Layout</a>.
</p>
</div>
</div>

<div id="outline-container-orgfb943fb" class="outline-3">
<h3 id="orgfb943fb"><span class="section-number-3">2.3</span> Data Types</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The basic data types of Pixie are bytes (8 bits), shorts (16 bits),
words (32 bits), and doublewords (64 bits). A byte can be located at
any memory location. Shorts, words, and doublewords must be aligned in
memory at natural boundaries. That is, a short must be located at an
even-numbered address, a word must be located at an address divisible
by four, and a doubleword must be located at an address divisible by
eight. Unaligned memory accesses will result in an error that will be
handled in an implementation-defined manner.
</p>

<p>
Some instructions interpret these basic data types as signed and
unsigned integers or addresses.
</p>
</div>
</div>

<div id="outline-container-org67f855a" class="outline-3">
<h3 id="org67f855a"><span class="section-number-3">2.4</span> Endianness and Addressing</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Bits of a memory location are arranged from right to left such that
the least significant bit is in the rightmost position and most
significant bit is in the leftmost position.
</p>

<p>
Shorts and words are stored in memory such that the least significant
byte is stored at the smallest memory address. The address of a short
or word is the address of its least significant byte.
</p>
</div>
</div>

<div id="outline-container-orge6c22ce" class="outline-3">
<h3 id="orge6c22ce"><span class="section-number-3">2.5</span> Modes of Operation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
At any point of time, Pixie operates in one of the two modes - user
mode or supervisor mode. The user mode is used to run normal programs
while the supervisor mode is used by the operating system and
interrupt handlers. Certain privileged instructions are only allowed
in the supervisor mode.
</p>

<p>
The current mode is indicated by the <a href="#org17e884b">Mode Indicator Bit</a> in the machine
status register. This bit can only be changed using a <a href="#org6aa924a">mode switching
operation</a>.
</p>
</div>
</div>

<div id="outline-container-org6aa924a" class="outline-3">
<h3 id="org6aa924a"><span class="section-number-3">2.6</span> Mode Switching</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The processor switches from user mode to supervisor mode on any of the
following conditions:
</p>

<ul class="org-ul">
<li>When an interrupt is serviced as described in <a href="#org3492027">Interrupt Handling</a> section.</li>
<li>When the processor executes the <a href="#org961ea00">SCL</a> instruction.</li>
</ul>

<p>
The processor switches from supervisor mode to user mode on any of the
following conditions:
</p>

<ul class="org-ul">
<li>When the processor executes the <a href="#org6e98e8f">RETI</a> instruction and the <a href="#org17e884b">Mode
Indicator</a> bit in the machine status register image in the stack is
clear.</li>
<li>When the processor executes the <a href="#org6e98e8f">RETS</a> instruction.</li>
</ul>
</div>
</div>

<div id="outline-container-orga78e83c" class="outline-3">
<h3 id="orga78e83c"><span class="section-number-3">2.7</span> Registers</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org31bca20" class="outline-4">
<h4 id="org31bca20"><span class="section-number-4">2.7.1</span> General Purpose Registers</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
There are sixteen 32-bit general purpose registers numbered from 0
to 15. The assembly instructions refer to these registers as <code>R0</code> to
<code>R15</code> respectively.
</p>
</div>
</div>
