docs/spec.org
*** Stack Pointer

The general purpose register =R15= is used as a stack pointer by some
instructions.

*** Program Counter Register

There is a 20-bit program counter register - named =PC= - that
contains the address of the next instruction to be processed. The
address stored in this register must be word aligned.

*** Machine Status Register

There is an 32-bit machine status register - named =MS= - that
contains various flags to indicate the status of the processor. The
flags are:

#+CAPTION: Machine Status Register
| Bit Position | Description                                                                      |
|--------------+----------------------------------------------------------------------------------|
|            0 | Zero Flag (=ZF=). This bit is set when the result of an operation is zero.       |
|            1 | Positive Flag (=PF=). This bit is set when result of an operation is positive.   |
|            2 | Negative Flag (=NF=). This bit is set when result of an operation is negative.   |
|         3-15 | Reserved.                                                                        |
|           16 | Mode Indicator (=MI=). This bit is set when the processor is in supervisor mode. |
|        17-31 | Reserved.                                                                        |

The machine status register cannot be loaded or stored directly by
instructions but accessed only indirectly.

*** Supervisor Stack Pointer Register

There is a 20-bit supervisor stack pointer register - named =SSP= - that
contains the address of a stack to be used in supervisor mode.

** Memory Layout

Memory address space of Pixie is classified as shown below.

#+CAPTION: Memory Layout
| Start Address | End Address | Description                  |
|---------------+-------------+------------------------------|
| =0x00000=     | =0x000ff=   | [[*Interrupt Vector Table][Interrupt Vector Table (IVT)]] |
| =0x00100=     | =0x001ff=   | [[*System Call Table][System Call Table (SCT)]]      |
| =0x00200=     | =0x07fff=   | Operating System             |
| =0x08000=     | =0xfffff=   | Available for user programs  |

Memory addresses below =0x08000= are called protected address
space. It is and error to access the protected address space while in
user mode and such accesses will be handled in an
implementation-defined manner.

** CPU Operation

Much like any conventional CPU, Pixie executes programs by executing
instructions in an instruction cycle. Each cycle consists of the
following steps in order:

1. Handle any pending interrupts as mentioned in [[*Interrupt   Handling][Interrupt Handling]]
   section.
2. Fetch the instruction addressed by the program counter register.
3. Increment program counter register by 4.
4. Decode the instruction. Any indirect memory contents required by
   the instruction are fetched during this step.
5. Execute the instruction.

** Input and Output

*** I/O Address Space

The I/O address space consists of 64 independently addressable 32-bit
ports. These ports are numbered from =0= to =63=. The I/O address
space is separate from the memory address space. It can only be
accessed by privileged instructions executed in supervisor mode.

*** Interrupt Handling

An interrupt is an asynchronous event triggered by an I/O device. An
interrupt is identified with a number, called an /interrupt
vector/. Pixie supports 64 interrupt vectors numbered from =0= to
=63=.

The processor checks for pending interrupts before beginning execution
of every instruction. If an interrupt is pending, the processor
performs the following operations to service the interrupt:

1. Check [[*Interrupt Vector Table][IVT]] entry corresponding to the interrupt vector. If the entry
   indicates that the interrupt is disabled, no further processing is
   done. Otherwise, the following steps are performed.
2. If the processor is in user mode, load =ZExtend(SSP, 32)= to =R15=
   and push the old value of =R15= to this new stack.
3. Push =MS= and =PC= to the stack in that order.
4. The [[*Machine Status Register][Mode Indicator]] bit in the machine status register is set to
   indicate that the processor is now executing in supervisor mode.
5. Load the address of the interrupt handler routine from the IVT
   entry to =PC=.
6. Processor begins execution of the interrupt handler routine.

The interrupt handler routine can execute the [[*RET][RETI]] instruction to
transfer the control back to the point where the interrupt occurred.

*** Interrupt Vector Table

The interrupt vector table (IVT) is a data structure located at memory
address =0x00000=. It is an array of 64 elements corresponding to each
of the interrupt vectors. Each element of IVT is word sized and has
the following structure:

#+CAPTION: IVT Entry Format
| Bit Position | Description                                                       |
|--------------+-------------------------------------------------------------------|
|         0-19 | Address of the interrupt handler routine                          |
|        20-30 | Reserved. Must be set to zero by the operating system.            |
|           31 | Interrupt Enable Bit. The interrupt is ignored if this bit clear. |

The operating system is responsible for populating entries in this
table during initialization.

