docs/spec.html

<div id="outline-container-org606b1c1" class="outline-4">
<h4 id="org606b1c1"><span class="section-number-4">2.7.2</span> Stack Pointer</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
The general purpose register <code>R15</code> is used as a stack pointer by some
instructions.
</p>
</div>
</div>

<div id="outline-container-orgd1b4342" class="outline-4">
<h4 id="orgd1b4342"><span class="section-number-4">2.7.3</span> Program Counter Register</h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
There is a 20-bit program counter register - named <code>PC</code> - that
contains the address of the next instruction to be processed. The
address stored in this register must be word aligned.
</p>
</div>
</div>

<div id="outline-container-org17e884b" class="outline-4">
<h4 id="org17e884b"><span class="section-number-4">2.7.4</span> Machine Status Register</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
There is an 32-bit machine status register - named <code>MS</code> - that
contains various flags to indicate the status of the processor. The
flags are:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 2:</span> Machine Status Register</caption>

<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Bit Position</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Zero Flag (<code>ZF</code>). This bit is set when the result of an operation is zero.</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Positive Flag (<code>PF</code>). This bit is set when result of an operation is positive.</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Negative Flag (<code>NF</code>). This bit is set when result of an operation is negative.</td>
</tr>

<tr>
<td class="org-right">3-15</td>
<td class="org-left">Reserved.</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">Mode Indicator (<code>MI</code>). This bit is set when the processor is in supervisor mode.</td>
</tr>

<tr>
<td class="org-right">17-31</td>
<td class="org-left">Reserved.</td>
</tr>
</tbody>
</table>

<p>
The machine status register cannot be loaded or stored directly by
instructions but accessed only indirectly.
</p>
</div>
</div>

<div id="outline-container-orga02bd71" class="outline-4">
<h4 id="orga02bd71"><span class="section-number-4">2.7.5</span> Supervisor Stack Pointer Register</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
There is a 20-bit supervisor stack pointer register - named <code>SSP</code> - that
contains the address of a stack to be used in supervisor mode.
</p>
</div>
</div>
</div>

<div id="outline-container-orga244ae7" class="outline-3">
<h3 id="orga244ae7"><span class="section-number-3">2.8</span> Memory Layout</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Memory address space of Pixie is classified as shown below.
</p>

<table>
<caption class="t-above"><span class="table-number">Table 3:</span> Memory Layout</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Start Address</th>
<th scope="col" class="org-left">End Address</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>0x00000</code></td>
<td class="org-left"><code>0x000ff</code></td>
<td class="org-left"><a href="#orge3cf95e">Interrupt Vector Table (IVT)</a></td>
</tr>

<tr>
<td class="org-left"><code>0x00100</code></td>
<td class="org-left"><code>0x001ff</code></td>
<td class="org-left"><a href="#orgfecb37a">System Call Table (SCT)</a></td>
</tr>

<tr>
<td class="org-left"><code>0x00200</code></td>
<td class="org-left"><code>0x07fff</code></td>
<td class="org-left">Operating System</td>
</tr>

<tr>
<td class="org-left"><code>0x08000</code></td>
<td class="org-left"><code>0xfffff</code></td>
<td class="org-left">Available for user programs</td>
</tr>
</tbody>
</table>

<p>
Memory addresses below <code>0x08000</code> are called protected address
space. It is and error to access the protected address space while in
user mode and such accesses will be handled in an
implementation-defined manner.
</p>
</div>
</div>

<div id="outline-container-orgfc38cc6" class="outline-3">
<h3 id="orgfc38cc6"><span class="section-number-3">2.9</span> CPU Operation</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Much like any conventional CPU, Pixie executes programs by executing
instructions in an instruction cycle. Each cycle consists of the
following steps in order:
</p>

<ol class="org-ol">
<li>Handle any pending interrupts as mentioned in <a href="#org3492027">Interrupt Handling</a>
section.</li>
<li>Fetch the instruction addressed by the program counter register.</li>
<li>Increment program counter register by 4.</li>
<li>Decode the instruction. Any indirect memory contents required by
the instruction are fetched during this step.</li>
<li>Execute the instruction.</li>
</ol>
</div>
</div>

<div id="outline-container-org24deb5d" class="outline-3">
<h3 id="org24deb5d"><span class="section-number-3">2.10</span> Input and Output</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org68e10e3" class="outline-4">
<h4 id="org68e10e3"><span class="section-number-4">2.10.1</span> I/O Address Space</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
The I/O address space consists of 64 independently addressable 32-bit
ports. These ports are numbered from <code>0</code> to <code>63</code>. The I/O address
space is separate from the memory address space. It can only be
accessed by privileged instructions executed in supervisor mode.
</p>
</div>
</div>

<div id="outline-container-org3492027" class="outline-4">
<h4 id="org3492027"><span class="section-number-4">2.10.2</span> Interrupt Handling</h4>
<div class="outline-text-4" id="text-2-10-2">
<p>
An interrupt is an asynchronous event triggered by an I/O device. An
interrupt is identified with a number, called an <i>interrupt
vector</i>. Pixie supports 64 interrupt vectors numbered from <code>0</code> to
<code>63</code>.
</p>

<p>
The processor checks for pending interrupts before beginning execution
of every instruction. If an interrupt is pending, the processor
performs the following operations to service the interrupt:
</p>

<ol class="org-ol">
<li>Check <a href="#orge3cf95e">IVT</a> entry corresponding to the interrupt vector. If the entry
indicates that the interrupt is disabled, no further processing is
done. Otherwise, the following steps are performed.</li>
<li>If the processor is in user mode, load <code>ZExtend(SSP, 32)</code> to <code>R15</code>
and push the old value of <code>R15</code> to this new stack.</li>
<li>Push <code>MS</code> and <code>PC</code> to the stack in that order.</li>
<li>The <a href="#org17e884b">Mode Indicator</a> bit in the machine status register is set to
indicate that the processor is now executing in supervisor mode.</li>
<li>Load the address of the interrupt handler routine from the IVT
entry to <code>PC</code>.</li>
<li>Processor begins execution of the interrupt handler routine.</li>
</ol>

<p>
The interrupt handler routine can execute the <a href="#org6e98e8f">RETI</a> instruction to
transfer the control back to the point where the interrupt occurred.
</p>
</div>
</div>

<div id="outline-container-orge3cf95e" class="outline-4">
<h4 id="orge3cf95e"><span class="section-number-4">2.10.3</span> Interrupt Vector Table</h4>
<div class="outline-text-4" id="text-2-10-3">
<p>
The interrupt vector table (IVT) is a data structure located at memory
address <code>0x00000</code>. It is an array of 64 elements corresponding to each
of the interrupt vectors. Each element of IVT is word sized and has
the following structure:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 4:</span> IVT Entry Format</caption>

<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Bit Position</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0-19</td>
<td class="org-left">Address of the interrupt handler routine</td>
</tr>

<tr>
<td class="org-right">20-30</td>
<td class="org-left">Reserved. Must be set to zero by the operating system.</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">Interrupt Enable Bit. The interrupt is ignored if this bit clear.</td>
</tr>
</tbody>
</table>

<p>
The operating system is responsible for populating entries in this
table during initialization.
</p>
</div>
</div>
</div>
