docs/spec.org
** System Calls

User mode programs can invoke services provided by the operating
system using the [[*SCL][SCL]] instruction. This instruction provides a
protected way of transferring control from user mode to supervisor
mode.

A system call is identified by a number called the /system call
vector/. A total of 64 system call vectors are supported numbered from
=0= to =63=.

Upon encountering the SCL instruction, the processor performs the
following steps:

1. Check the [[*System Call Table][SCT]] entry corresponding to the system call
   vector. Disabled entries will result in an error which will be
   handled in an implementation-defined manner.
2. Load =ZExtend(SSP, 32)= to =R15= and push the old value of =R15= in
   this new stack.
3. Push =MS= and =PC= to the stack in that order.
4. The [[*Machine Status Register][Mode Indicator]] bit in the machine status register is set to
   indicate that the processor is now executing in supervisor mode.
5. Load the address of the system call handler routine from the SCT
   entry to =PC=.
6. Processor begins execution of the system call handler routine.

Additional parameters can be passed to the system call handler routine
in the general purpose registers or user mode stack.

The system call handler routine can return to user mode by executing
the [[*RET][RETS]] instruction. Results can be passed to user mode caller in the
general purpose registers or user mode stack.

*** System Call Table

The system call table (SCT) is a data structure located at memory
address =0x00100=. It is an array of 64 elements corresponding to each
of the system call vectors. Each element of SCT is word sized and has
the following structure:

#+CAPTION: SCT Entry Format
| Bit Position | Description                                                         |
|--------------+---------------------------------------------------------------------|
|         0-19 | Address of the system call handler routine                          |
|        20-30 | Reserved. Must be set to zero by the operating system.              |
|           31 | System Call Enable Bit. The system call fails if this bit is clear. |

The operating system is responsible for populating entries in this
table during initialization.

** Initialization

During start up, Pixie is initialized to the following state:

#+CAPTION: System Initial State
| Element                           | Initial State                                                      |
|-----------------------------------+--------------------------------------------------------------------|
| General Purpose Registers         | =0x00000000=                                                       |
| Program Counter Register          | =0x00200=                                                          |
| Machine Status Register           | =0x00010001=                                                       |
| Supervisor Stack Pointer Register | =0x00000=                                                          |
| IVT                               | All entries are set to =0x00000000=.                               |
| SCT                               | All entries are set to =0x00000000=.                               |
| Memory                            | Contents of memory locations other than IVT and SCT are undefined. |

An implementation of Pixie may load an operating system and user
program(s) into memory during startup in an implementation-defined
manner.

** Instruction Format

An instruction is comprises of an opcode, an optional destination
operand, zero to two source operands written in that order.

The operands are classified into different categories mentioned below.

*** Register Operands

These operands are located in a general purpose register. They are
denoted as =SR= and =DR= in the instructions. They are encoded by
their 4 bit register numbers.

*** Immediate Operands

These operands are located in the instruction itself. They are denoted
as =imm5= and =imm16= in the instructions and have lengths of 5 and 16
bits respectively. They are encoded by 5 bit or 16 bit numbers
respectively.

*** Absolute Address Operands

These operands are memory addressed located in the instruction
itself. They are denoted as =addr20= in the instructions and have a
length of 20 bits. They are encoded as a 20 bit number.

*** Indirect

These operands are located in a memory location whose address is
located in a general purpose register. They are denoted as =[SR]= and
=[DR]= in the instructions. They are encoded by their 4 bit register
numbers.

*** Register or Indirect

These operands are either located in a general purpose register or in
a memory location whose address is located in a general purpose
register. They are denoted as =SO=, =SO1=, =SO2=, and =DO= in the
instructions. They are encoded by a 5 bit number whose least
significant 4 bits are the register number and the most significant
bit is set if and only if the operand is located in memory.

* Instructions

This section contains a comprehencive list of all instructions and
their encodings.

Many instruction encodings contain bit fields marked as
/Reserved/. These must be filled with zeroes for compatibility
reasons.

** ADD

Adds two source operands and stores the result in the destination
operand.

*** Encodings

#+CAPTION: =ADD DO, SO1, SO2=
| Bit Position |     31-27 | 26-22 | 21-17 |  16 |     15-5 |   4-0 |
|--------------+-----------+-------+-------+-----+----------+-------|
|              | =0b00100= |  =DO= | =SO1= | =0= | Reserved | =SO2= |

#+CAPTION: =ADD DO, SO1, imm16=
| Bit Position |     31-27 | 26-22 | 21-17 |  16 |    15-0 |
|--------------+-----------+-------+-------+-----+---------|
|              | =0b00100= |  =DO= | =SO1= | =1= | =imm16= |

*** Operation

#+BEGIN_SRC
if (instruction[16] == 0)
  DO = SO1 + SO2;
else
  DO = SO1 + SExtend(imm16, 32);

Set_Flags(DO);
#+END_SRC

*** Flags Affected
=ZF=, =PF=, =NF=

