docs/spec.html

<div id="outline-container-org48f6ad1" class="outline-3">
<h3 id="org48f6ad1"><span class="section-number-3">2.11</span> System Calls</h3>
<div class="outline-text-3" id="text-2-11">
<p>
User mode programs can invoke services provided by the operating
system using the <a href="#org961ea00">SCL</a> instruction. This instruction provides a
protected way of transferring control from user mode to supervisor
mode.
</p>

<p>
A system call is identified by a number called the <i>system call
vector</i>. A total of 64 system call vectors are supported numbered from
<code>0</code> to <code>63</code>.
</p>

<p>
Upon encountering the SCL instruction, the processor performs the
following steps:
</p>

<ol class="org-ol">
<li>Check the <a href="#orgfecb37a">SCT</a> entry corresponding to the system call
vector. Disabled entries will result in an error which will be
handled in an implementation-defined manner.</li>
<li>Load <code>ZExtend(SSP, 32)</code> to <code>R15</code> and push the old value of <code>R15</code> in
this new stack.</li>
<li>Push <code>MS</code> and <code>PC</code> to the stack in that order.</li>
<li>The <a href="#org17e884b">Mode Indicator</a> bit in the machine status register is set to
indicate that the processor is now executing in supervisor mode.</li>
<li>Load the address of the system call handler routine from the SCT
entry to <code>PC</code>.</li>
<li>Processor begins execution of the system call handler routine.</li>
</ol>

<p>
Additional parameters can be passed to the system call handler routine
in the general purpose registers or user mode stack.
</p>

<p>
The system call handler routine can return to user mode by executing
the <a href="#org6e98e8f">RETS</a> instruction. Results can be passed to user mode caller in the
general purpose registers or user mode stack.
</p>
</div>

<div id="outline-container-orgfecb37a" class="outline-4">
<h4 id="orgfecb37a"><span class="section-number-4">2.11.1</span> System Call Table</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
The system call table (SCT) is a data structure located at memory
address <code>0x00100</code>. It is an array of 64 elements corresponding to each
of the system call vectors. Each element of SCT is word sized and has
the following structure:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 5:</span> SCT Entry Format</caption>

<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Bit Position</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0-19</td>
<td class="org-left">Address of the system call handler routine</td>
</tr>

<tr>
<td class="org-right">20-30</td>
<td class="org-left">Reserved. Must be set to zero by the operating system.</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">System Call Enable Bit. The system call fails if this bit is clear.</td>
</tr>
</tbody>
</table>

<p>
The operating system is responsible for populating entries in this
table during initialization.
</p>
</div>
</div>
</div>

<div id="outline-container-org82e9792" class="outline-3">
<h3 id="org82e9792"><span class="section-number-3">2.12</span> Initialization</h3>
<div class="outline-text-3" id="text-2-12">
<p>
During start up, Pixie is initialized to the following state:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 6:</span> System Initial State</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Element</th>
<th scope="col" class="org-left">Initial State</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">General Purpose Registers</td>
<td class="org-left"><code>0x00000000</code></td>
</tr>

<tr>
<td class="org-left">Program Counter Register</td>
<td class="org-left"><code>0x00200</code></td>
</tr>

<tr>
<td class="org-left">Machine Status Register</td>
<td class="org-left"><code>0x00010001</code></td>
</tr>

<tr>
<td class="org-left">Supervisor Stack Pointer Register</td>
<td class="org-left"><code>0x00000</code></td>
</tr>

<tr>
<td class="org-left">IVT</td>
<td class="org-left">All entries are set to <code>0x00000000</code>.</td>
</tr>

<tr>
<td class="org-left">SCT</td>
<td class="org-left">All entries are set to <code>0x00000000</code>.</td>
</tr>

<tr>
<td class="org-left">Memory</td>
<td class="org-left">Contents of memory locations other than IVT and SCT are undefined.</td>
</tr>
</tbody>
</table>

<p>
An implementation of Pixie may load an operating system and user
program(s) into memory during startup in an implementation-defined
manner.
</p>
</div>
</div>

<div id="outline-container-org97236de" class="outline-3">
<h3 id="org97236de"><span class="section-number-3">2.13</span> Instruction Format</h3>
<div class="outline-text-3" id="text-2-13">
<p>
An instruction is comprises of an opcode, an optional destination
operand, zero to two source operands written in that order.
</p>

<p>
The operands are classified into different categories mentioned below.
</p>
</div>

<div id="outline-container-orga8d8173" class="outline-4">
<h4 id="orga8d8173"><span class="section-number-4">2.13.1</span> Register Operands</h4>
<div class="outline-text-4" id="text-2-13-1">
<p>
These operands are located in a general purpose register. They are
denoted as <code>SR</code> and <code>DR</code> in the instructions. They are encoded by
their 4 bit register numbers.
</p>
</div>
</div>

<div id="outline-container-org7368e0c" class="outline-4">
<h4 id="org7368e0c"><span class="section-number-4">2.13.2</span> Immediate Operands</h4>
<div class="outline-text-4" id="text-2-13-2">
<p>
These operands are located in the instruction itself. They are denoted
as <code>imm5</code> and <code>imm16</code> in the instructions and have lengths of 5 and 16
bits respectively. They are encoded by 5 bit or 16 bit numbers
respectively.
</p>
</div>
</div>

<div id="outline-container-org8c375b1" class="outline-4">
<h4 id="org8c375b1"><span class="section-number-4">2.13.3</span> Absolute Address Operands</h4>
<div class="outline-text-4" id="text-2-13-3">
<p>
These operands are memory addressed located in the instruction
itself. They are denoted as <code>addr20</code> in the instructions and have a
length of 20 bits. They are encoded as a 20 bit number.
</p>
</div>
</div>

<div id="outline-container-orgfc3605c" class="outline-4">
<h4 id="orgfc3605c"><span class="section-number-4">2.13.4</span> Indirect</h4>
<div class="outline-text-4" id="text-2-13-4">
<p>
These operands are located in a memory location whose address is
located in a general purpose register. They are denoted as <code>[SR]</code> and
<code>[DR]</code> in the instructions. They are encoded by their 4 bit register
numbers.
</p>
</div>
</div>

<div id="outline-container-org712f5f5" class="outline-4">
<h4 id="org712f5f5"><span class="section-number-4">2.13.5</span> Register or Indirect</h4>
<div class="outline-text-4" id="text-2-13-5">
<p>
These operands are either located in a general purpose register or in
a memory location whose address is located in a general purpose
register. They are denoted as <code>SO</code>, <code>SO1</code>, <code>SO2</code>, and <code>DO</code> in the
instructions. They are encoded by a 5 bit number whose least
significant 4 bits are the register number and the most significant
bit is set if and only if the operand is located in memory.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c7c6aa" class="outline-2">
<h2 id="org3c7c6aa"><span class="section-number-2">3</span> Instructions</h2>
<div class="outline-text-2" id="text-3">
<p>
This section contains a comprehencive list of all instructions and
their encodings.
</p>

<p>
Many instruction encodings contain bit fields marked as
<i>Reserved</i>. These must be filled with zeroes for compatibility
reasons.
</p>
</div>

<div id="outline-container-org5d8d54b" class="outline-3">
<h3 id="org5d8d54b"><span class="section-number-3">3.1</span> ADD</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Adds two source operands and stores the result in the destination
operand.
</p>
</div>
