docs/spec.org
** SUB

Subtracts the second source operand from the first source operand and
stores the result in the destination operand.

*** Encodings

#+CAPTION: =SUB DO, SO1, SO2=
| Bit Position |     31-27 | 26-22 | 21-17 |  16 |     15-5 |   4-0 |
|--------------+-----------+-------+-------+-----+----------+-------|
|              | =0b00000= |  =DO= | =SO1= | =0= | Reserved | =SO2= |

#+CAPTION: =SUB DO, SO1, imm16=
| Bit Position |     31-27 | 26-22 | 21-17 |  16 |    15-0 |
|--------------+-----------+-------+-------+-----+---------|
|              | =0b00000= |  =DO= | =SO1= | =1= | =imm16= |

*** Operation

#+BEGIN_SRC
if (instruction[16] == 0)
  DO = SO1 - SO2;
else
  DO = SO1 - SExtend(imm16, 32);

Set_Flags(DO);
#+END_SRC

*** Flags Affected
=ZF=, =PF=, =NF=

** MUL

Multiples two source operands and stores the result in the destination
operand. The size of the destination operand is always double that of
the source operands.

The =IMUL= instruction variant multiplies two signed numbers and
stores the result into the destination operand. The =UMUL= instruction
variant multiplies two unsigned numbers and stores the result into the
destination operand.

Both these instruction variants are further classified into byte,
short, and word variants.

The byte instruction variant multiplies the least significant 8 bits of
the source operands and stores the result into the least significant
16 bits of the destination operand.

The short instruction variant multiplies the least significant 16 bits
of the source operands and stores the result into the destination
operand word.

The word instruction variant multiplies the source operand words and
stores the result into the destination operand doubleword. If the
destination operand is a register =DR=, the least significant word of
the result is stored in the register =DR= and the most significant
word in the register =(DR + 1) modulo 8=.

*** Encodings

#+CAPTION: =IMULB DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =0= | =0b01= | Reserved |  =DO= | =SO1= | =SO2= |

#+CAPTION: =IMULS DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =0= | =0b10= | Reserved |  =DO= | =SO1= | =SO2= |

#+CAPTION: =IMULW DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =0= | =0b11= | Reserved |  =DO= | =SO1= | =SO2= |

#+CAPTION: =UMULB DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =1= | =0b01= | Reserved |  =DO= | =SO1= | =SO2= |

#+CAPTION: =UMULS DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =1= | =0b10= | Reserved |  =DO= | =SO1= | =SO2= |

#+CAPTION: =UMULW DO, SO1, SO2=
| Bit Position |     31-27 |  26 |  25-24 |    23-15 | 14-10 |   9-5 |   4-0 |
|--------------+-----------+-----+--------+----------+-------+-------+-------|
|              | =0b01111= | =1= | =0b11= | Reserved |  =DO= | =SO1= | =SO2= |

