docs/spec.html

<div id="outline-container-org9dc51bb" class="outline-4">
<h4 id="org9dc51bb"><span class="section-number-4">3.1.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-1-1">
<table>
<caption class="t-above"><span class="table-number">Table 7:</span> <code>ADD DO, SO1, SO2</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00100</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>SO2</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 8:</span> <code>ADD DO, SO1, imm16</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00100</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>1</code></td>
<td class="org-right"><code>imm16</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0118b97" class="outline-4">
<h4 id="org0118b97"><span class="section-number-4">3.1.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
if (instruction[16] == 0)
  DO = SO1 + SO2;
else
  DO = SO1 + SExtend(imm16, 32);

Set_Flags(DO);
</pre>
</div>
</div>

<div id="outline-container-org5af6955" class="outline-4">
<h4 id="org5af6955"><span class="section-number-4">3.1.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<code>ZF</code>, <code>PF</code>, <code>NF</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgbe45737" class="outline-3">
<h3 id="orgbe45737"><span class="section-number-3">3.2</span> SUB</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Subtracts the second source operand from the first source operand and
stores the result in the destination operand.
</p>
</div>

<div id="outline-container-org0f25f62" class="outline-4">
<h4 id="org0f25f62"><span class="section-number-4">3.2.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-2-1">
<table>
<caption class="t-above"><span class="table-number">Table 9:</span> <code>SUB DO, SO1, SO2</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00000</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>SO2</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 10:</span> <code>SUB DO, SO1, imm16</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00000</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>1</code></td>
<td class="org-right"><code>imm16</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org147730b" class="outline-4">
<h4 id="org147730b"><span class="section-number-4">3.2.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-2-2">
<pre class="example">
if (instruction[16] == 0)
  DO = SO1 - SO2;
else
  DO = SO1 - SExtend(imm16, 32);

Set_Flags(DO);
</pre>
</div>
</div>

<div id="outline-container-orgc7809c7" class="outline-4">
<h4 id="orgc7809c7"><span class="section-number-4">3.2.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
<code>ZF</code>, <code>PF</code>, <code>NF</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org08c1226" class="outline-3">
<h3 id="org08c1226"><span class="section-number-3">3.3</span> MUL</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Multiples two source operands and stores the result in the destination
operand. The size of the destination operand is always double that of
the source operands.
</p>

<p>
The <code>IMUL</code> instruction variant multiplies two signed numbers and
stores the result into the destination operand. The <code>UMUL</code> instruction
variant multiplies two unsigned numbers and stores the result into the
destination operand.
</p>

<p>
Both these instruction variants are further classified into byte,
short, and word variants.
</p>

<p>
The byte instruction variant multiplies the least significant 8 bits of
the source operands and stores the result into the least significant
16 bits of the destination operand.
</p>

<p>
The short instruction variant multiplies the least significant 16 bits
of the source operands and stores the result into the destination
operand word.
</p>

<p>
The word instruction variant multiplies the source operand words and
stores the result into the destination operand doubleword. If the
destination operand is a register <code>DR</code>, the least significant word of
the result is stored in the register <code>DR</code> and the most significant
word in the register <code>(DR + 1) modulo 8</code>.
</p>
</div>
