docs/spec.org
** SHF

Bit shift.

Shift the source operand by a specified number of bits to the left or
right and store the result in the destination operand.

The left shift operation (=SHFL=) fills the vacated bit positions with
zeroes. The right shift operation can be logical or arithmetic. The
logical right shift operation (=SHFRL=) fills the vacated bit
positions with zeroes while the arithmetic right shift operation
(=SHFRA=) fills the vacated bit positions by the most significant bit.

*** Encodings

#+CAPTION: =SHFL DO, SO, imm5=
| Bit Position |     31-27 |  26-25 |    24-15 | 14-10 |  9-5 |    4-0 |
|--------------+-----------+--------+----------+-------+------+--------|
|              | =0b10000= | =0b00= | Reserved |  =DO= | =SO= | =imm5= |

#+CAPTION: =SHFRL DO, SO, imm5=
| Bit Position |     31-27 |  26-25 |    24-15 | 14-10 |  9-5 |    4-0 |
|--------------+-----------+--------+----------+-------+------+--------|
|              | =0b10000= | =0b10= | Reserved |  =DO= | =SO= | =imm5= |

#+CAPTION: =SHFRA DO, SO, imm5=
| Bit Position |     31-27 |  26-25 |    24-15 | 14-10 |  9-5 |    4-0 |
|--------------+-----------+--------+----------+-------+------+--------|
|              | =0b10000= | =0b11= | Reserved |  =DO= | =SO= | =imm5= |

*** Operation

#+BEGIN_SRC
if (instruction[26:25] == 0)
  DO = LShift(SO, imm5);
else if (instruction[26:25] == 2)
  DO = RShift(SO, imm5);
else if (instruction[26:25] == 3)
  DO = RAShift(SO, imm5);

Set_Flags(DO);
#+END_SRC

*** Flags Affected
=ZF=, =PF=, =NF=

** JC

Jump conditionally. Tests zero or more flags and performs a jump if
any of them are set.

Note that =JCnzp= will always perform a jump regardless of the state of
the flags and =JC= will never perform the jump. For this reason, it is
not necessary for assemblers to support these instruction variants.

It is an error if the target address of the jump is not word aligned.

*** Encodings

- =JCn   addr20=
- =JCp   addr20=
- =JCz   addr20=
- =JCnp  addr20=
- =JCnz  addr20=
- =JCzp  addr20=
- =JCnzp addr20=

#+CAPTION: =JC addr20=
| Bit Position |     31-27 |  26 |  25 |  24 |    23-21 |  20 |     19-0 |
|--------------+-----------+-----+-----+-----+----------+-----+----------|
|              | =0b10111= | =n= | =p= | =z= | Reserved | =0= | =addr20= |

- =JCn   [SR]=
- =JCp   [SR]=
- =JCz   [SR]=
- =JCnp  [SR]=
- =JCnz  [SR]=
- =JCzp  [SR]=
- =JCnzp [SR]=

#+CAPTION: =JC [SR]=
| Bit Position |     31-27 |  26 |  25 |  24 |    23-21 |  20 |     19-4 |    3-0 |
|--------------+-----------+-----+-----+-----+----------+-----+----------+--------|
|              | =0b10111= | =n= | =p= | =z= | Reserved | =1= | Reserved | =[SR]= |

*** Operation

#+BEGIN_SRC
if ((n && NF) || (p && PF) || (z && ZF)) {
  if (instruction[20] == 0)
    addr = addr20;
  else
    addr = SR[19:0];
  
  if ((addr % 4) != 0)
    Handle alignment error;
  else
    PC = addr;
}
#+END_SRC

*** Flags Affected
None.

** JMP

Jump unconditionally.

Note that this instruction uses the same opcode as [[*JC][JC]] and the encoding
is the same as =JCnzp=.

It is an error if the target address of the jump is not word aligned.

*** Encodings

#+CAPTION: =JMP addr20=
| Bit Position |     31-27 |   26-24 |    23-21 |  20 |     19-0 |
|--------------+-----------+---------+----------+-----+----------|
|              | =0b10111= | =0b111= | Reserved | =0= | =addr20= |

#+CAPTION: =JMP [SR]=
| Bit Position |     31-27 |   26-24 |    23-21 |  20 |     19-4 |    3-0 |
|--------------+-----------+---------+----------+-----+----------+--------|
|              | =0b10111= | =0b111= | Reserved | =1= | Reserved | =[SR]= |

*** Operation

#+BEGIN_SRC
if (instruction[20] == 0)
  addr = addr20;
else
  addr = SR[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  PC = addr;
#+END_SRC

*** Flags Affected
None.

