docs/spec.html

<div id="outline-container-org29fa28f" class="outline-4">
<h4 id="org29fa28f"><span class="section-number-4">3.9.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-9-1">
<table>
<caption class="t-above"><span class="table-number">Table 27:</span> <code>XOR DO, SO1, SO2</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10101</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>SO2</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 28:</span> <code>XOR DO, SO1, imm16</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">15-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10101</code></td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO1</code></td>
<td class="org-right"><code>1</code></td>
<td class="org-right"><code>imm16</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf348816" class="outline-4">
<h4 id="orgf348816"><span class="section-number-4">3.9.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-9-2">
<pre class="example">
if (instruction[16] == 0)
  DO = SO1 ^ SO2
else
  DO = SO1 ^ SExtend(imm16, 32)

Set_Flags(DO);
</pre>
</div>
</div>

<div id="outline-container-org9556096" class="outline-4">
<h4 id="org9556096"><span class="section-number-4">3.9.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-9-3">
<p>
<code>ZF</code>, <code>PF</code>, <code>NF</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org6d7d6d9" class="outline-3">
<h3 id="org6d7d6d9"><span class="section-number-3">3.10</span> SHF</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Bit shift.
</p>

<p>
Shift the source operand by a specified number of bits to the left or
right and store the result in the destination operand.
</p>

<p>
The left shift operation (<code>SHFL</code>) fills the vacated bit positions with
zeroes. The right shift operation can be logical or arithmetic. The
logical right shift operation (<code>SHFRL</code>) fills the vacated bit
positions with zeroes while the arithmetic right shift operation
(<code>SHFRA</code>) fills the vacated bit positions by the most significant bit.
</p>
</div>

<div id="outline-container-org13b5a4d" class="outline-4">
<h4 id="org13b5a4d"><span class="section-number-4">3.10.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-10-1">
<table>
<caption class="t-above"><span class="table-number">Table 29:</span> <code>SHFL DO, SO, imm5</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-25</th>
<th scope="col" class="org-right">24-15</th>
<th scope="col" class="org-right">14-10</th>
<th scope="col" class="org-right">9-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10000</code></td>
<td class="org-right"><code>0b00</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO</code></td>
<td class="org-right"><code>imm5</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 30:</span> <code>SHFRL DO, SO, imm5</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-25</th>
<th scope="col" class="org-right">24-15</th>
<th scope="col" class="org-right">14-10</th>
<th scope="col" class="org-right">9-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10000</code></td>
<td class="org-right"><code>0b10</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO</code></td>
<td class="org-right"><code>imm5</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 31:</span> <code>SHFRA DO, SO, imm5</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-25</th>
<th scope="col" class="org-right">24-15</th>
<th scope="col" class="org-right">14-10</th>
<th scope="col" class="org-right">9-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10000</code></td>
<td class="org-right"><code>0b11</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DO</code></td>
<td class="org-right"><code>SO</code></td>
<td class="org-right"><code>imm5</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org38e584a" class="outline-4">
<h4 id="org38e584a"><span class="section-number-4">3.10.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-10-2">
<pre class="example">
if (instruction[26:25] == 0)
  DO = LShift(SO, imm5);
else if (instruction[26:25] == 2)
  DO = RShift(SO, imm5);
else if (instruction[26:25] == 3)
  DO = RAShift(SO, imm5);

Set_Flags(DO);
</pre>
</div>
</div>

<div id="outline-container-orgd84f16c" class="outline-4">
<h4 id="orgd84f16c"><span class="section-number-4">3.10.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-10-3">
<p>
<code>ZF</code>, <code>PF</code>, <code>NF</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org080f87e" class="outline-3">
<h3 id="org080f87e"><span class="section-number-3">3.11</span> JC</h3>
<div class="outline-text-3" id="text-3-11">
<p>
Jump conditionally. Tests zero or more flags and performs a jump if
any of them are set.
</p>

<p>
Note that <code>JCnzp</code> will always perform a jump regardless of the state of
the flags and <code>JC</code> will never perform the jump. For this reason, it is
not necessary for assemblers to support these instruction variants.
</p>

<p>
It is an error if the target address of the jump is not word aligned.
</p>
</div>

<div id="outline-container-org2f8bf5c" class="outline-4">
<h4 id="org2f8bf5c"><span class="section-number-4">3.11.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-11-1">
<ul class="org-ul">
<li><code>JCn   addr20</code></li>
<li><code>JCp   addr20</code></li>
<li><code>JCz   addr20</code></li>
<li><code>JCnp  addr20</code></li>
<li><code>JCnz  addr20</code></li>
<li><code>JCzp  addr20</code></li>
<li><code>JCnzp addr20</code></li>
</ul>

<table>
<caption class="t-above"><span class="table-number">Table 32:</span> <code>JC addr20</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25</th>
<th scope="col" class="org-right">24</th>
<th scope="col" class="org-right">23-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10111</code></td>
<td class="org-right"><code>n</code></td>
<td class="org-right"><code>p</code></td>
<td class="org-right"><code>z</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>0</code></td>
<td class="org-right"><code>addr20</code></td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>JCn   SR</code></li>
<li><code>JCp   SR</code></li>
<li><code>JCz   SR</code></li>
<li><code>JCnp  SR</code></li>
<li><code>JCnz  SR</code></li>
<li><code>JCzp  SR</code></li>
<li><code>JCnzp SR</code></li>
</ul>

<table>
<caption class="t-above"><span class="table-number">Table 33:</span> <code>JC [SR]</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25</th>
<th scope="col" class="org-right">24</th>
<th scope="col" class="org-right">23-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-4</th>
<th scope="col" class="org-right">3-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10111</code></td>
<td class="org-right"><code>n</code></td>
<td class="org-right"><code>p</code></td>
<td class="org-right"><code>z</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>[SR]</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org934a9c4" class="outline-4">
<h4 id="org934a9c4"><span class="section-number-4">3.11.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-11-2">
<pre class="example">
if ((n &amp;&amp; NF) || (p &amp;&amp; PF) || (z &amp;&amp; ZF)) {
  if (instruction[20] == 0)
    addr = addr20;
  else
    addr = SR[19:0];

  if ((addr % 4) != 0)
    Handle alignment error;
  else
    PC = addr;
}
</pre>
</div>
</div>

<div id="outline-container-org9fe7d43" class="outline-4">
<h4 id="org9fe7d43"><span class="section-number-4">3.11.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-11-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org2e07f6f" class="outline-3">
<h3 id="org2e07f6f"><span class="section-number-3">3.12</span> JMP</h3>
<div class="outline-text-3" id="text-3-12">
<p>
Jump unconditionally.
</p>

<p>
Note that this instruction uses the same opcode as <a href="#org080f87e">JC</a> and the encoding
is the same as <code>JCnzp</code>.
</p>

<p>
It is an error if the target address of the jump is not word aligned.
</p>
</div>
