docs/spec.org
** CALL

Call subroutine.

Saves return information on the stack and branches to the called
subroutine.

It is an error if the address of the subroutine is not word aligned.

*** Encodings

#+CAPTION: =CALL addr20=
| Bit Position |     31-27 |  26 |    25-21 |  20 |     19-0 |
|--------------+-----------+-----+----------+-----+----------|
|              | =0b01000= | =0= | Reserved | =0= | =addr20= |

#+CAPTION: =CALL [SR]=
| Bit Position |     31-27 |  26 |    25-21 |  20 |     19-4 |    3-0 |
|--------------+-----------+-----+----------+-----+----------+--------|
|              | =0b01000= | =0= | Reserved | =1= | Reserved | =[SR]= |

*** Operation

#+BEGIN_SRC
R15 = R15 - 4;
MemW[R15] = ZExtend(PC, 32);
if (instruction[20] == 0)
  addr = addr20;
else
  addr = SR[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  PC = addr;
#+END_SRC

*** Flags Affected
None.

** SCL

Call operating system service.

Saves return information on the stack and branches to a system call
handler routine.

It is an error if the address of the system call handler routine is
not word aligned.

*** Encodings

#+CAPTION: =SCL imm5=
| Bit Position |     31-27 |  26 |     25-5 |    4-0 |
|--------------+-----------+-----+----------+--------|
|              | =0b01000= | =1= | Reserved | =imm5= |

*** Operation

#+BEGIN_SRC
if (SCT[imm5][31] == 0)
  Handle SCT disabled error;
else {
  temp = R15;
  R15 = ZExtend(SSP, 32);
  R15 = R15 - 4;
  MemW[R15] = temp;
  R15 = R15 - 4;
  MemW[R15] = MS;
  R15 = R15 - 4;
  MemW[R15] = ZExtend(PC, 32);
  MI = 1;

  addr = SCT[imm5][19:0];
  if ((addr % 4) != 0)
    Handle alignment error;
  else
    PC = addr;
}
#+END_SRC

*** Flags Affected
=MI=

** RET

Return from a subroutine, interrupt handler routine, or a system call
handler routine.

Restores the return information from the stack and branches to the
caller or savepoint.

It is an error if the target address of the return is not word aligned.

*** Encodings

#+CAPTION: =RET=
| Bit Position |     31-27 |  26 |     25-0 |
|--------------+-----------+-----+----------|
|              | =0b00011= | =0= | Reserved |

#+CAPTION: =RETI= or =RETS=
| Bit Position |     31-27 |  26 |     25-0 |
|--------------+-----------+-----+----------|
|              | =0b00011= | =1= | Reserved |

*** Operation

#+BEGIN_SRC
if (instruction[26] == 1 && MI == 0)
  Handle privilege violation error;

addr = MemW[R15][19:0];
R15 = R15 + 4;

if ((addr % 4) != 0)
  Handle alignment error;
else {
  PC = addr;

  if (instruction[26] == 1) {
    MS = MemW[R15];
    R15 = R15 + 4;
    if (MI == 0) {
      R15 = MemW[R15];
    }
  }
}
#+END_SRC

*** Flags Affected
=ZF=, =PF=, =NF=, =MI=

** LD

Load a byte, short, or word from memory to a register.

The source operand specifies a memory address. The contents of this
address is optionally sign extended and stored into the destination
register.

*** Encodings

#+CAPTION: =LDB DR, addr20=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-0 |
|--------------+-----------+--------+-------+-----+----------|
|              | =0b01001= | =0b01= |  =DR= | =0= | =addr20= |

#+CAPTION: =LDB DR, [SR]=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-4 |  3-0 |
|--------------+-----------+--------+-------+-----+----------+------|
|              | =0b01001= | =0b01= |  =DR= | =1= | Reserved | =SR= |

#+CAPTION: =LDS DR, addr20=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-0 |
|--------------+-----------+--------+-------+-----+----------|
|              | =0b01001= | =0b10= |  =DR= | =0= | =addr20= |

#+CAPTION: =LDS DR, [SR]=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-4 |  3-0 |
|--------------+-----------+--------+-------+-----+----------+------|
|              | =0b01001= | =0b10= |  =DR= | =1= | Reserved | =SR= |

#+CAPTION: =LDW DR, addr20=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-0 |
|--------------+-----------+--------+-------+-----+----------|
|              | =0b01001= | =0b11= |  =DR= | =0= | =addr20= |

#+CAPTION: =LDW DR, [SR]=
| Bit Position |     31-27 |  26-25 | 24-21 |  20 |     19-4 |  3-0 |
|--------------+-----------+--------+-------+-----+----------+------|
|              | =0b01001= | =0b11= |  =DR= | =1= | Reserved | =SR= |

