docs/spec.html

<div id="outline-container-org4e53be3" class="outline-4">
<h4 id="org4e53be3"><span class="section-number-4">3.12.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-12-1">
<table>
<caption class="t-above"><span class="table-number">Table 34:</span> <code>JMP addr20</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-24</th>
<th scope="col" class="org-right">23-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10111</code></td>
<td class="org-right"><code>0b111</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>0</code></td>
<td class="org-right"><code>addr20</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 35:</span> <code>JMP [SR]</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-24</th>
<th scope="col" class="org-right">23-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-4</th>
<th scope="col" class="org-right">3-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10111</code></td>
<td class="org-right"><code>0b111</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>[SR]</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org91fcd4c" class="outline-4">
<h4 id="org91fcd4c"><span class="section-number-4">3.12.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-12-2">
<pre class="example">
if (instruction[20] == 0)
  addr = addr20;
else
  addr = SR[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  PC = addr;
</pre>
</div>
</div>

<div id="outline-container-orgaaca8d8" class="outline-4">
<h4 id="orgaaca8d8"><span class="section-number-4">3.12.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-12-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org53c2179" class="outline-3">
<h3 id="org53c2179"><span class="section-number-3">3.13</span> CALL</h3>
<div class="outline-text-3" id="text-3-13">
<p>
Call subroutine.
</p>

<p>
Saves return information on the stack and branches to the called
subroutine.
</p>

<p>
It is an error if the address of the subroutine is not word aligned.
</p>
</div>

<div id="outline-container-org9b9f7ab" class="outline-4">
<h4 id="org9b9f7ab"><span class="section-number-4">3.13.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-13-1">
<table>
<caption class="t-above"><span class="table-number">Table 36:</span> <code>CALL addr20</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b01000</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>0</code></td>
<td class="org-right"><code>addr20</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 37:</span> <code>CALL [SR]</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-4</th>
<th scope="col" class="org-right">3-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b01000</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>[SR]</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge9ed4e9" class="outline-4">
<h4 id="orge9ed4e9"><span class="section-number-4">3.13.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-13-2">
<pre class="example">
R15 = R15 - 4;
MemW[R15] = ZExtend(PC, 32);
if (instruction[20] == 0)
  addr = addr20;
else
  addr = SR[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  PC = addr;
</pre>
</div>
</div>

<div id="outline-container-org67d8bbc" class="outline-4">
<h4 id="org67d8bbc"><span class="section-number-4">3.13.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-13-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org961ea00" class="outline-3">
<h3 id="org961ea00"><span class="section-number-3">3.14</span> SCL</h3>
<div class="outline-text-3" id="text-3-14">
<p>
Call operating system service.
</p>

<p>
Saves return information on the stack and branches to a system call
handler routine.
</p>

<p>
It is an error if the address of the system call handler routine is
not word aligned.
</p>
</div>

<div id="outline-container-orgf52e6d3" class="outline-4">
<h4 id="orgf52e6d3"><span class="section-number-4">3.14.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-14-1">
<table>
<caption class="t-above"><span class="table-number">Table 38:</span> <code>SCL imm5</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b01000</code></td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>imm5</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc2f4313" class="outline-4">
<h4 id="orgc2f4313"><span class="section-number-4">3.14.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-14-2">
<pre class="example">
if (SCT[imm5][31] == 0)
  Handle SCT disabled error;
else {
  temp = R15;
  R15 = ZExtend(SSP, 32);
  R15 = R15 - 4;
  MemW[R15] = temp;
  R15 = R15 - 4;
  MemW[R15] = MS;
  R15 = R15 - 4;
  MemW[R15] = ZExtend(PC, 32);
  MI = 1;

  addr = SCT[imm5][19:0];
  if ((addr % 4) != 0)
    Handle alignment error;
  else
    PC = addr;
}
</pre>
</div>
</div>

<div id="outline-container-org0530bf2" class="outline-4">
<h4 id="org0530bf2"><span class="section-number-4">3.14.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-14-3">
<p>
<code>MI</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org6e98e8f" class="outline-3">
<h3 id="org6e98e8f"><span class="section-number-3">3.15</span> RET</h3>
<div class="outline-text-3" id="text-3-15">
<p>
Return from a subroutine, interrupt handler routine, or a system call
handler routine.
</p>

<p>
Restores the return information from the stack and branches to the
caller or savepoint.
</p>

<p>
It is an error if the target address of the return is not word aligned.
</p>
</div>

<div id="outline-container-org7a6c7c7" class="outline-4">
<h4 id="org7a6c7c7"><span class="section-number-4">3.15.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-15-1">
<table>
<caption class="t-above"><span class="table-number">Table 39:</span> <code>RET</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00011</code></td>
<td class="org-right"><code>0</code></td>
<td class="org-right">Reserved</td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 40:</span> <code>RETI</code> or <code>RETS</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">25-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00011</code></td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8e0615f" class="outline-4">
<h4 id="org8e0615f"><span class="section-number-4">3.15.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-15-2">
<pre class="example">
if (instruction[26] == 1 &amp;&amp; MI == 0)
  Handle privilege violation error;

addr = MemW[R15][19:0];
R15 = R15 + 4;

if ((addr % 4) != 0)
  Handle alignment error;
else {
  PC = addr;

  if (instruction[26] == 1) {
    MS = MemW[R15];
    R15 = R15 + 4;
    if (MI == 0) {
      R15 = MemW[R15];
    }
  }
}
</pre>
</div>
</div>

<div id="outline-container-org2448076" class="outline-4">
<h4 id="org2448076"><span class="section-number-4">3.15.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-15-3">
<p>
<code>ZF</code>, <code>PF</code>, <code>NF</code>, <code>MI</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orga8e91ea" class="outline-3">
<h3 id="orga8e91ea"><span class="section-number-3">3.16</span> LD</h3>
<div class="outline-text-3" id="text-3-16">
<p>
Load a byte, short, or word from memory to a register.
</p>

<p>
The source operand specifies a memory address. The contents of this
address is optionally sign extended and stored into the destination
register.
</p>
</div>
