docs/spec.org
** CPY

Copy a source register or immediate value to the destination register.

The copy instruction has two variants in case of an immediate
operand. The value is either sign extended to 32 bits and copied
(CPYI) or zero extended to 32 bits and copied (CPYU).

*** Encodings

#+CAPTION: =CPYI DR, imm16=
| Bit Position |     31-27 |    26-22 | 21-17 |  17-16 |    15-0 |
|--------------+-----------+----------+-------+--------+---------|
|              | =0b00010= | Reserved |  =DR= | =0b00= | =imm16= |

#+CAPTION: =CPYU DR, imm16=
| Bit Position |     31-27 |    26-22 | 21-17 |  17-16 |    15-0 |
|--------------+-----------+----------+-------+--------+---------|
|              | =0b00010= | Reserved |  =DR= | =0b01= | =imm16= |

#+CAPTION: =CPY DR, SR=
| Bit Position |     31-27 |    26-22 | 21-17 |  17-16 |     15-4 |  3-0 |
|--------------+-----------+----------+-------+--------+----------+------|
|              | =0b00010= | Reserved |  =DR= | =0b10= | Reserved | =SR= |

*** Operation

#+BEGIN_SRC
if (instruction[17:16] == 0)
  DR = SExtend(imm16, 32);
else if (instruction[17:16] == 1)
  DR = ZExtend(imm16, 32);
else if (instruction[17:16] == 2)
  DR = SR;
#+END_SRC

*** Flags Affected
None.

** PUSH

Push the source operand on top of the stack.

The stack pointer (R15) is decremented by 4 and the source operand is
stored at that memory location.

There are two variants of the instruction when the source operand is a
16 bit immediate value. The value is either sign extended to 32 bits
and copied (PUSHI) or zero extended to 32 bits and copied (PUSHU).

There are three variants of the instruction when the source operand is
either in =addr20= or =SO= form. The value stored in the stack always
have a 32 bit size. The value is sign extended to 32 bits if the
operand is a byte or short.

*** Encodings

#+CAPTION: =PUSHI imm16=
| Bit Position |     31-27 |  26 |  25-24 |    23-17 |  16 |    15-0 |
|--------------+-----------+-----+--------+----------+-----+---------|
|              | =0b11111= | =0= | =0b00= | Reserved | =0= | =imm16= |

#+CAPTION: =PUSHU imm16=
| Bit Position |     31-27 |  26 |  25-24 |    23-17 |  16 |    15-0 |
|--------------+-----------+-----+--------+----------+-----+---------|
|              | =0b11111= | =0= | =0b00= | Reserved | =1= | =imm16= |

#+CAPTION: =PUSHB addr20=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-0 |
|--------------+-----------+-----+--------+----------+-----+----------|
|              | =0b11111= | =0= | =0b01= | Reserved | =0= | =addr20= |

#+CAPTION: =PUSHB SO=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-5 |  4-0 |
|--------------+-----------+-----+--------+----------+-----+----------+------|
|              | =0b11111= | =0= | =0b01= | Reserved | =1= | Reserved | =SO= |

#+CAPTION: =PUSHS addr20=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-0 |
|--------------+-----------+-----+--------+----------+-----+----------|
|              | =0b11111= | =0= | =0b10= | Reserved | =0= | =addr20= |

#+CAPTION: =PUSHS SO=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-5 |  4-0 |
|--------------+-----------+-----+--------+----------+-----+----------+------|
|              | =0b11111= | =0= | =0b10= | Reserved | =1= | Reserved | =SO= |

#+CAPTION: =PUSHW addr20=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-0 |
|--------------+-----------+-----+--------+----------+-----+----------|
|              | =0b11111= | =0= | =0b11= | Reserved | =0= | =addr20= |

#+CAPTION: =PUSHW SO=
| Bit Position |     31-27 |  26 |  25-24 |    23-21 |  20 |     19-5 |  4-0 |
|--------------+-----------+-----+--------+----------+-----+----------+------|
|              | =0b11111= | =0= | =0b11= | Reserved | =1= | Reserved | =SO= |

