docs/spec.html

<div id="outline-container-org44a1f84" class="outline-4">
<h4 id="org44a1f84"><span class="section-number-4">3.17.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-17-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org9356010" class="outline-3">
<h3 id="org9356010"><span class="section-number-3">3.18</span> CPY</h3>
<div class="outline-text-3" id="text-3-18">
<p>
Copy a source register or immediate value to the destination register.
</p>

<p>
The copy instruction has two variants in case of an immediate
operand. The value is either sign extended to 32 bits and copied
(CPYI) or zero extended to 32 bits and copied (CPYU).
</p>
</div>

<div id="outline-container-org59c913b" class="outline-4">
<h4 id="org59c913b"><span class="section-number-4">3.18.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-18-1">
<table>
<caption class="t-above"><span class="table-number">Table 53:</span> <code>CPYI DR, imm16</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">17-16</th>
<th scope="col" class="org-right">15-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00010</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DR</code></td>
<td class="org-right"><code>0b00</code></td>
<td class="org-right"><code>imm16</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 54:</span> <code>CPYU DR, imm16</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">17-16</th>
<th scope="col" class="org-right">15-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00010</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DR</code></td>
<td class="org-right"><code>0b01</code></td>
<td class="org-right"><code>imm16</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 55:</span> <code>CPY DR, SR</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-22</th>
<th scope="col" class="org-right">21-17</th>
<th scope="col" class="org-right">17-16</th>
<th scope="col" class="org-right">15-4</th>
<th scope="col" class="org-right">3-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00010</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>DR</code></td>
<td class="org-right"><code>0b10</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>SR</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdfaa1d9" class="outline-4">
<h4 id="orgdfaa1d9"><span class="section-number-4">3.18.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-18-2">
<pre class="example">
if (instruction[17:16] == 0)
  DR = SExtend(imm16, 32);
else if (instruction[17:16] == 1)
  DR = ZExtend(imm16, 32);
else if (instruction[17:16] == 2)
  DR = SR;
</pre>
</div>
</div>

<div id="outline-container-org7103822" class="outline-4">
<h4 id="org7103822"><span class="section-number-4">3.18.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-18-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-orgef010e0" class="outline-3">
<h3 id="orgef010e0"><span class="section-number-3">3.19</span> PUSH</h3>
<div class="outline-text-3" id="text-3-19">
<p>
Push the source operand on top of the stack.
</p>

<p>
The stack pointer (R15) is decremented by 4 and the source operand is
stored at that memory location.
</p>

<p>
There are two variants of the instruction when the source operand is a
16 bit immediate value. The value is either sign extended to 32 bits
and copied (PUSHI) or zero extended to 32 bits and copied (PUSHU).
</p>

<p>
There are three variants of the instruction when the source operand is
either in <code>addr20</code> or <code>SO</code> form. The value stored in the stack always
have a 32 bit size. The value is sign extended to 32 bits if the
operand is a byte or short.
</p>
</div>
