docs/spec.org
** SSSP

Set supervisor stack pointer register.

This is a privileged instruction and can only be executed in
supervisor mode.

The value loaded to SSP register must be aligned on a word boundary.

*** Encodings

#+CAPTION: =SSSP addr20=
| Bit Position |     31-27 |    26-21 |  20 |     19-0 |
|--------------+-----------+----------+-----+----------|
|              | =0b00110= | Reserved | =0= | =addr20= |

#+CAPTION: =SSSP SO=
| Bit Position |     31-27 |    26-21 |  20 |     19-5 |  4-0 |
|--------------+-----------+----------+-----+----------+------|
|              | =0b00110= | Reserved | =1= | Reserved | =SO= |

*** Operation

#+BEGIN_SRC
if (MI == 0)
  Handle privilege violation error;

if (instruction[20] == 0)
  addr = MemW[addr20][19:0];
else
  addr = SO[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  SSP = addr;
#+END_SRC

*** Flags Affected
None.

** HALT

Stop execution and halt the computer.

It is implementation-defined if/how the computer can transition out of
the halted state.

This is a privileged instruction and can only be executed in
supervisor mode.

*** Encodings

#+CAPTION: =SSSP addr20=
| Bit Position |     31-27 |    26-21 |  20 |     19-0 |
|--------------+-----------+----------+-----+----------|
|              | =0b10001= | Reserved | =0= | =addr20= |

*** Operation

#+BEGIN_SRC
if (MI == 0)
  Handle privilege violation error;
else
  Halt the computer;
#+END_SRC

*** Flags Affected
None.

* Standard I/O Devices

A Pixie implementation must support the following I/O devices.

- Clock
- Character Input
- Character Output

** Clock

The clock device can be used to get the current date and time
according to the Gregorian calendar. The device does not support
updating the date and time. Any additional details related to date and
time - such as the timezone or leap second support - are
implementation-defined.

The date and time can be read from I/O ports numbered 4 and 5. The
words read from these ports have the following format:

#+CAPTION: Date Word (Port 4)
| Bit Position |    31-25 | 24-20 | 19-16 |    15-0 |
| Description  | Reserved |   day | month |    year |
| Range        |          |  1-31 |  1-12 | 0-65535 |

#+CAPTION: Time Word (Port 5)
| Bit Position |    31-17 | 16-12 |   11-6 |    5-0 |
| Description  | Reserved |  hour | minute | second |
| Range        |          |  0-23 |   0-59 |   0-59 |

** Character Input

This device provides ASCII character inputs. The device raises
interrupt vector 8 when a character is available as input. The
interrupt handler routine can read the character from I/O port
number 8. The word read from this port has the following format.

#+CAPTION: ASCII Input Word Format (Port 8)
| Bit Position |  31 |      30-7 |            6-0 |
|--------------+-----+-----------+----------------|
|              | AVL | Undefined | Character Code |

The character code is valid only if the /AVL/ bit is set.

After reading the code from the port and before issuing a [[*RET][RETI]]
instruction, the interrupt handler routine must write a word with
value zero to port 8. This indicates that the handler is ready to
receive additional interrupts. The device must not raise more
interrupts unless the zero word is written to the port.

** Character Output

This device can output ASCII characters. Character should be written
to I/O port number 12 for output. The word written to this port must
have the following format:

#+CAPTION: ASCII Output Word Format (Port 12)
| Bit Position |              31-7 |            6-0 |
|--------------+-------------------+----------------|
|              | Ignored by device | Character Code |
