docs/spec.html

<div id="outline-container-org207880e" class="outline-4">
<h4 id="org207880e"><span class="section-number-4">3.22.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-22-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-org538f9c3" class="outline-3">
<h3 id="org538f9c3"><span class="section-number-3">3.23</span> SSSP</h3>
<div class="outline-text-3" id="text-3-23">
<p>
Set supervisor stack pointer register.
</p>

<p>
This is a privileged instruction and can only be executed in
supervisor mode.
</p>

<p>
The value loaded to SSP register must be aligned on a word boundary.
</p>
</div>

<div id="outline-container-org85f1572" class="outline-4">
<h4 id="org85f1572"><span class="section-number-4">3.23.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-23-1">
<table>
<caption class="t-above"><span class="table-number">Table 74:</span> <code>SSSP addr20</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00110</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>0</code></td>
<td class="org-right"><code>addr20</code></td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 75:</span> <code>SSSP SO</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-5</th>
<th scope="col" class="org-right">4-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b00110</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>1</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>SO</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfeeb03c" class="outline-4">
<h4 id="orgfeeb03c"><span class="section-number-4">3.23.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-23-2">
<pre class="example">
if (MI == 0)
  Handle privilege violation error;

if (instruction[20] == 0)
  addr = MemW[addr20][19:0];
else
  addr = SO[19:0];

if ((addr % 4) != 0)
  Handle alignment error;
else
  SSP = addr;
</pre>
</div>
</div>

<div id="outline-container-org7a52254" class="outline-4">
<h4 id="org7a52254"><span class="section-number-4">3.23.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-23-3">
<p>
None.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdff880f" class="outline-3">
<h3 id="orgdff880f"><span class="section-number-3">3.24</span> HALT</h3>
<div class="outline-text-3" id="text-3-24">
<p>
Stop execution and halt the computer.
</p>

<p>
It is implementation-defined if/how the computer can transition out of
the halted state.
</p>

<p>
This is a privileged instruction and can only be executed in
supervisor mode.
</p>
</div>

<div id="outline-container-org8d2b189" class="outline-4">
<h4 id="org8d2b189"><span class="section-number-4">3.24.1</span> Encodings</h4>
<div class="outline-text-4" id="text-3-24-1">
<table>
<caption class="t-above"><span class="table-number">Table 76:</span> <code>SSSP addr20</code></caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-27</th>
<th scope="col" class="org-right">26-21</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-right">19-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><code>0b10001</code></td>
<td class="org-right">Reserved</td>
<td class="org-right"><code>0</code></td>
<td class="org-right"><code>addr20</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgce4a6fa" class="outline-4">
<h4 id="orgce4a6fa"><span class="section-number-4">3.24.2</span> Operation</h4>
<div class="outline-text-4" id="text-3-24-2">
<pre class="example">
if (MI == 0)
  Handle privilege violation error;
else
  Halt the computer;
</pre>
</div>
</div>

<div id="outline-container-orgf199ce7" class="outline-4">
<h4 id="orgf199ce7"><span class="section-number-4">3.24.3</span> Flags Affected</h4>
<div class="outline-text-4" id="text-3-24-3">
<p>
None.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org32901b9" class="outline-2">
<h2 id="org32901b9"><span class="section-number-2">4</span> Standard I/O Devices</h2>
<div class="outline-text-2" id="text-4">
<p>
A Pixie implementation must support the following I/O devices.
</p>

<ul class="org-ul">
<li>Clock</li>
<li>Character Input</li>
<li>Character Output</li>
</ul>
</div>

<div id="outline-container-org7f0538d" class="outline-3">
<h3 id="org7f0538d"><span class="section-number-3">4.1</span> Clock</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The clock device can be used to get the current date and time
according to the Gregorian calendar. The device does not support
updating the date and time. Any additional details related to date and
time - such as the timezone or leap second support - are
implementation-defined.
</p>

<p>
The date and time can be read from I/O ports numbered 4 and 5. The
words read from these ports have the following format:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 77:</span> Date Word (Port 4)</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">Bit Position</td>
<td class="org-left">31-25</td>
<td class="org-right">24-20</td>
<td class="org-right">19-16</td>
<td class="org-right">15-0</td>
</tr>

<tr>
<td class="org-left">Description</td>
<td class="org-left">Reserved</td>
<td class="org-right">day</td>
<td class="org-right">month</td>
<td class="org-right">year</td>
</tr>

<tr>
<td class="org-left">Range</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1-31</td>
<td class="org-right">1-12</td>
<td class="org-right">0-65535</td>
</tr>
</tbody>
</table>

<table>
<caption class="t-above"><span class="table-number">Table 78:</span> Time Word (Port 5)</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">Bit Position</td>
<td class="org-left">31-17</td>
<td class="org-right">16-12</td>
<td class="org-right">11-6</td>
<td class="org-right">5-0</td>
</tr>

<tr>
<td class="org-left">Description</td>
<td class="org-left">Reserved</td>
<td class="org-right">hour</td>
<td class="org-right">minute</td>
<td class="org-right">second</td>
</tr>

<tr>
<td class="org-left">Range</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0-23</td>
<td class="org-right">0-59</td>
<td class="org-right">0-59</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge871ea4" class="outline-3">
<h3 id="orge871ea4"><span class="section-number-3">4.2</span> Character Input</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This device provides ASCII character inputs. The device raises
interrupt vector 8 when a character is available as input. The
interrupt handler routine can read the character from I/O port
number 8. The word read from this port has the following format.
</p>

<table>
<caption class="t-above"><span class="table-number">Table 79:</span> ASCII Input Word Format (Port 8)</caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31</th>
<th scope="col" class="org-right">30-7</th>
<th scope="col" class="org-right">6-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">AVL</td>
<td class="org-right">Undefined</td>
<td class="org-right">Character Code</td>
</tr>
</tbody>
</table>

<p>
The character code is valid only if the <i>AVL</i> bit is set.
</p>

<p>
After reading the code from the port and before issuing a <a href="#org6e98e8f">RETI</a>
instruction, the interrupt handler routine must write a word with
value zero to port 8. This indicates that the handler is ready to
receive additional interrupts. The device must not raise more
interrupts unless the zero word is written to the port.
</p>
</div>
</div>

<div id="outline-container-org95377ef" class="outline-3">
<h3 id="org95377ef"><span class="section-number-3">4.3</span> Character Output</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This device can output ASCII characters. Character should be written
to I/O port number 12 for output. The word written to this port must
have the following format:
</p>

<table>
<caption class="t-above"><span class="table-number">Table 80:</span> ASCII Output Word Format (Port 12)</caption>

<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bit Position</th>
<th scope="col" class="org-right">31-7</th>
<th scope="col" class="org-right">6-0</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">Ignored by device</td>
<td class="org-right">Character Code</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
